// Импорт типа StaticImageData для использования с изображениями в Next.js
import { StaticImageData } from 'next/image';

// Интерфейс для типизации данных, получаемых от API для домашней страницы
export interface HomeDataApiResponse {
	// Данные для слайдера на главной странице
	slider: {
		link: StaticImageData; // Ссылка на изображение с типом StaticImageData
		alt: string; // Атрибут alt для изображения
	};

	// Данные для среднего баннера на главной странице
	bannerMiddle: {
		link: StaticImageData; // Ссылка на изображение для баннера
		alt: string; // Атрибут alt для изображения баннера
	};

	// Данные для нижнего баннера на главной странице
	bannerBottom: {
		medium: {
			// Медиум-версия изображения
			link: StaticImageData; // Ссылка на изображение
			alt: string; // Атрибут alt для изображения
		};
		small: {
			// Маленькие версии изображений в массиве
			link: StaticImageData; // Ссылка на изображение
			alt: string; // Атрибут alt для изображения
		}[]; // Массив объектов с изображениями для маленьких версий
	};

	// Данные для продуктов, отображаемых на главной странице
	sliderProducts: {
		bestOffer: {
			// Продукты с лучшими предложениями
			title: string; // Заголовок для раздела с лучшими предложениями
			list: {
				// Список продуктов
				id: string; // Уникальный идентификатор продукта
				images: StaticImageData; // Изображения продукта
				title: string; // Название продукта
				price: number; // Цена продукта
			}[]; // Массив объектов с данными о продуктах
		};

		bestSelling: {
			// Продукты с лучшими продажами
			title: string; // Заголовок для раздела с самыми продаваемыми товарами
			list: {
				// Список продуктов
				id: string; // Уникальный идентификатор продукта
				images: StaticImageData; // Изображение продукта
				title: string; // Название продукта
				price: number; // Цена продукта
			}[]; // Массив объектов с данными о продуктах
		};
	};
}
