// Импортируем тип StaticImageData для работы с изображениями в Next.js
import { StaticImageData } from 'next/image';

// Интерфейс для типизации данных продуктов в списке
export interface ListProducts {
	// Категория продукта (например, электроника, одежда и т. д.)
	category: string;

	// Описание продукта: массив объектов, каждый объект содержит заголовок и описание
	description: {
		title: string; // Заголовок описания
		content: string; // Содержимое описания
	}[]; // Массив описаний для одного продукта

	// Уникальный идентификатор продукта
	id: string;

	// Массив изображений продукта (например, несколько изображений товара)
	images: StaticImageData[]; // Список изображений с типом StaticImageData

	// Цена продукта
	price: number;

	// Оценка продукта (например, рейтинг от пользователей)
	score: number;

	// Суммарное описание или дополнительные характеристики продукта
	summery: string;

	// Название продукта
	title: string;
}
