// Импортируем тип StaticImageData для работы с изображениями в Next.js
import { StaticImageData } from 'next/image';

// Интерфейс для типизации данных ответа API для списка продуктов
export interface ProductsDataApiResponse {
	// Массив объектов, каждый из которых представляет собой продукт
	list: ProductDataApiResponse[]; // Список продуктов
}

// Интерфейс для типизации данных ответа API для отдельного продукта
export interface ProductDataApiResponse {
	// Уникальный идентификатор продукта
	id: string;

	// Название продукта
	title: string;

	// Цена продукта
	price: number;

	// Массив изображений продукта
	images: StaticImageData[]; // Список изображений с типом StaticImageData

	// Суммарное описание или дополнительные характеристики продукта
	summery: string;

	// Описание продукта: массив объектов, каждый объект содержит заголовок и описание
	description: {
		title: string; // Заголовок описания (например, "Особенности продукта")
		content: string; // Содержимое описания (например, "Большой экран и мощный процессор")
	}[]; // Массив объектов, представляющих описание продукта
}
